Файлы_конфигурации/Documents/ПереносРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПереносРезерва</Name>
			<BasedOn>
				<xr:Item>Document.РезервированиеТовара</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервированиеТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/AccumulationRegisters/РезервированиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>РезервированиеТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРезерва</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Файлы_конфигурации/Enums/СтатусыРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмененный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализованный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Файлы_конфигурации/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Файлы_конфигурации/Documents/РезервированиеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РезервированиеТовара</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Покупатели</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервированиеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Покупатели</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносРезерва</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтмены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтменаРезервированияТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПереноса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПереносРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходноКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Таблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЕдиницыИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОпределяемыйТипСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Файлы_конфигурации/Documents/ПереносРезерва/Ext/ObjectModule.bsl
//Вычисление СуммыДокумента перед записью
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Чтобы нельзя было поправить сумму документа перед записью документа
	СуммаДокумента = Таблица.Итог("Сумма");
	
КонецПроцедуры

//Движения по регистру РезервированиеТоваров
Процедура ОбработкаПроведения(Отказ, Режим)

	Если СтатусРезерва = Перечисления.СтатусыРезерва.Действующий Тогда
		
	
		//Если значение не пустое ОбъектОснование
		//Если статус резерва ОбъектОснование действующий!!!!
		
		Если ЗначениеЗаполнено(ОбъектОснование)  Тогда
			Если ОбъектОснование.СтатусРезерва<>Перечисления.СтатусыРезерва.Действующий Тогда
				Отказ = Истина;
				Сообщить("Резерв не может быть перенесен, потому что его статус <<"+ОбъектОснование.СтатусРезерва+">>. Для перенова резерва статус должен быть <<Действующий>>.");
				Возврат;	
			КонецЕсли;
		Иначе 
			Отказ = Истина;
			Сообщить("Поле  <<ОбъектОснование>> не заполнено!");
			Возврат;
			
		КонецЕсли;
		
		
		//очистить прошлые движения по документу
		Движения.РезервированиеТоваров.Очистить();
		Движения.РезервированиеТоваров.Записывать = Истина;
		Движения.Записать();
		
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеТовараТаблица.Номенклатура                 КАК Номенклатура,
		|	РезервированиеТовараТаблица.НаборСвойств                 КАК НаборСвойств,
		|	СУММА(РезервированиеТовараТаблица.Количество * РезервированиеТовараТаблица.КоэффициентЕдиницыИзмерения) КАК Количество,
		|	РезервированиеТовараТаблица.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ ТаблицаИзДокументаРезерва
		|ИЗ
		|	Документ.РезервированиеТовара.Таблица                    КАК РезервированиеТовараТаблица
		|ГДЕ
		|	РезервированиеТовараТаблица.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервированиеТовараТаблица.Номенклатура,
		|	РезервированиеТовараТаблица.НаборСвойств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервированиеТовара.Организация          КАК Организация,
		|	РезервированиеТовара.Склад                КАК Склад,
		|	РезервированиеТовара.Контрагент           КАК Контрагент,
		|	РезервированиеТовара.Покупатель           КАК Покупатель,
		|	РезервированиеТовара.СтатусРезерва        КАК СтатусРезерва,
		|	ТаблицаИзДокументаРезерва.Номенклатура    КАК Номенклатура,
		|	ТаблицаИзДокументаРезерва.НаборСвойств    КАК НаборСвойств,
		|	ТаблицаИзДокументаРезерва.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТаблицаИзДокументаРезерва.Количество      КАК Количество
		|ИЗ
		|	Документ.РезервированиеТовара             КАК РезервированиеТовара,
		|	ТаблицаИзДокументаРезерва                 КАК ТаблицаИзДокументаРезерва
		|ГДЕ
		|	РезервированиеТовара.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектОснование);
		
		РезультатЗапроса       = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		// Регистр РезервированиеТоваров Расход
		Движения.РезервированиеТоваров.Записывать = Истина;
		
		ЭтоТовар = Перечисления.ВидыНоменклатуры.Товар;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = ЭтоТовар Тогда
				
				Движение                        = Движения.РезервированиеТоваров.Добавить();
				Движение.ВидДвижения            = ВидДвиженияНакопления.Расход;
				Движение.Период                 = Дата;
				Движение.Организация            = ВыборкаДетальныеЗаписи.Организация;
				Движение.Склад                  = ВыборкаДетальныеЗаписи.Склад;
				Движение.Контрагент             = ВыборкаДетальныеЗаписи.Контрагент;
				Движение.Покупатель             = ВыборкаДетальныеЗаписи.Покупатель;	
				Движение.Номенклатура           = ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.ВариантНоменклатуры    = ВыборкаДетальныеЗаписи.НаборСвойств;
				Движение.КоличествоРезерва      = ВыборкаДетальныеЗаписи.Количество;
				
			Иначе 
				
				Сообщить("Номенклатура <<"+ВыборкаДетальныеЗаписи.Номенклатура+">> с набором свойств <<"+
				ВыборкаДетальныеЗаписи.НаборСвойств+">> это не товар.");
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		
		//Делаем проверку на наличие отрицательного резерва
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервированиеТоваровОстатки.Организация              КАК Организация,
		|	РезервированиеТоваровОстатки.Склад                    КАК Склад,
		|	РезервированиеТоваровОстатки.Контрагент               КАК Контрагент,
		|	РезервированиеТоваровОстатки.Покупатель               КАК Покупатель,
		|	РезервированиеТоваровОстатки.Номенклатура             КАК Номенклатура,
		|	РезервированиеТоваровОстатки.ВариантНоменклатуры      КАК ВариантНоменклатуры,
		|	РезервированиеТоваровОстатки.КоличествоРезерваОстаток КАК КоличествоРезерваОстаток
		|ИЗ
		|	РегистрНакопления.РезервированиеТоваров.Остатки(
		|			&ВыбДата,
		|			Организация = &ВыбОрганизация
		|				И Склад = &ВыбСклад
		|				И Контрагент = &ВыбКонтрагент
		|				И Покупатель = &ВыбПокупатель)            КАК РезервированиеТоваровОстатки";
		
		Запрос.УстановитьПараметр("ВыбДата",        ТекущаяДата());   	
		Запрос.УстановитьПараметр("ВыбОрганизация", ОбъектОснование.Организация);
		Запрос.УстановитьПараметр("ВыбСклад",       ОбъектОснование.Склад);
		Запрос.УстановитьПараметр("ВыбКонтрагент",  ОбъектОснование.Контрагент);
		Запрос.УстановитьПараметр("ВыбПокупатель",  ОбъектОснование.Покупатель);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоРезерваОстаток < 0 Тогда
				
				Сообщить("Номенклатура <<"+ВыборкаДетальныеЗаписи.Номенклатура+">> с набором свойств <<"+
				ВыборкаДетальныеЗаписи.ВариантНоменклатуры+">> превышает остаток в резерве! Проверьте документ: "+ 
				ОбъектОснование+" и посмотрите Отчет по резервированию товаров на складе.");
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Если по регистрам все хорошо прошло
		Если Отказ = Ложь Тогда
			
			//меняем старому документу резерва статус
			ДокОбъект                  = ОбъектОснование.ПолучитьОбъект();
			ДокОбъект.СтатусРезерва    = Перечисления.СтатусыРезерва.Перенесен;
			ДокОбъект.ДокументПереноса = Ссылка;
			ДокОбъект.Записать();
			
			СтатусРезерва              = Перечисления.СтатусыРезерва.Перенесен;
			
			//создаем новый документ резерва
			ДокРезерв                  = Документы.РезервированиеТовара.СоздатьДокумент();
			ДокРезерв.Дата             = ТекущаяДата();
			ДокРезерв.ОбъектОснование  = Ссылка;
			ДокРезерв.ВидЦен           = ВидЦен;
			ДокРезерв.Договор          = Договор;
			ДокРезерв.Комментарий      = "Перенос резерва";
			ДокРезерв.Контрагент       = Контрагент;
			ДокРезерв.Организация      = Организация;
			ДокРезерв.Покупатель       = Покупатель;
			ДокРезерв.Склад            = Склад;
			ДокРезерв.СтатусРезерва    = Перечисления.СтатусыРезерва.Действующий;
			ДокРезерв.СуммаДокумента   = СуммаДокумента;
			Для Каждого ТекСтрокаТаблица Из Таблица Цикл
				НоваяСтрока                             = ДокРезерв.Таблица.Добавить();
				НоваяСтрока.ЕдиницыИзмерения            = ТекСтрокаТаблица.ЕдиницыИзмерения;
				НоваяСтрока.Количество                  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.КоэффициентЕдиницыИзмерения = ТекСтрокаТаблица.КоэффициентЕдиницыИзмерения;
				НоваяСтрока.НаборСвойств                = ТекСтрокаТаблица.НаборСвойств;
				НоваяСтрока.Номенклатура                = ТекСтрокаТаблица.Номенклатура;
				НоваяСтрока.Сумма                       = ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Цена                        = ТекСтрокаТаблица.Цена;
			КонецЦикла;
			ДокРезерв.Записать(РежимЗаписиДокумента.Проведение,
			РежимПроведенияДокумента.Оперативный);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

//Проверяем заполнены ЕдиницыИзмерения у номенклатуры
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Удаляем из проверяемых реквизитов Единицы измерения
	//ПроверяемыеРеквизиты это массив. У массива есть методы Найти() и Удалить().
	Индекс = ПроверяемыеРеквизиты.Найти("Таблица.ЕдиницыИзмерения");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
	
	// Обходим строки и проверяем заполнение реквизита
	Для Индекс = 0 по Таблица.Количество()-1 Цикл
		
		СтрокаТаблицы       = Таблица.Получить(Индекс);
		
		Если СтрокаТаблицы.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга
			И Не ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницыИзмерения) Тогда
			
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + (Индекс+1) + " не заполнено значение единицы измерения";
			Сообщение.Поле  = "Таблица[" + Индекс + "].ЕдиницыИзмерения";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ           = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Ввод на основании Документа РезервированиеТовара 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РезервированиеТовара") Тогда
		// Заполнение шапки
		ОбъектОснование = ДанныеЗаполнения;
		ВидЦен          = ДанныеЗаполнения.ВидЦен;
		Договор         = ДанныеЗаполнения.Договор;
		Комментарий     = ДанныеЗаполнения.Комментарий;
		Контрагент      = ДанныеЗаполнения.Контрагент;
		Организация     = ДанныеЗаполнения.Организация;
		Покупатель      = ДанныеЗаполнения.Покупатель;
		Склад           = ДанныеЗаполнения.Склад;
		СтатусРезерва   = ДанныеЗаполнения.СтатусРезерва;
		СуммаДокумента  = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			НоваяСтрока                             = Таблица.Добавить();
			НоваяСтрока.ЕдиницыИзмерения            = ТекСтрокаТаблица.ЕдиницыИзмерения;
			НоваяСтрока.Количество                  = ТекСтрокаТаблица.Количество;
			НоваяСтрока.КоэффициентЕдиницыИзмерения = ТекСтрокаТаблица.КоэффициентЕдиницыИзмерения;
			НоваяСтрока.НаборСвойств                = ТекСтрокаТаблица.НаборСвойств;
			НоваяСтрока.Номенклатура                = ТекСтрокаТаблица.Номенклатура;
			НоваяСтрока.Сумма                       = ТекСтрокаТаблица.Сумма;
			НоваяСтрока.Цена                        = ТекСтрокаТаблица.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
